Revit 2026 API

# TemperatureRatingTypeSetErase Method

---

Removes a specified TemperatureRating type from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	TemperatureRatingType item
)
```
```vb
Public Overridable Function Erase (
	item As TemperatureRatingType
) As Integer
```
```cpp
public:
virtual int Erase(
	TemperatureRatingType^ item
)
```
```fsharp
abstract Erase :
        item : TemperatureRatingType -> int
override Erase :
        item : TemperatureRatingType -> int
```

#### Parameters

item TemperatureRatingType
    The TemperatureRating type to be erased.

#### Return Value

Int32The number of TemperatureRating types that were erased from the set.

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace